GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
/*
 * Copyright (c) 2019-2020 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv6m.h"
#include "stm32l0_usbd_msc.h"
#include "stm32l0_usbd_class.h"
#include "dosfs_storage.h"

extern void USB_IRQHandler(void);

/***********************************************************************************************************************/

#define SCSI_OPCODE_TEST_UNIT_READY                               0x00
#define SCSI_OPCODE_REQUEST_SENSE                                 0x03
#define SCSI_OPCODE_INQUIRY                                       0x12
#define SCSI_OPCODE_MODE_SENSE_6                                  0x1a
#define SCSI_OPCODE_START_STOP_UNIT                               0x1b
#define SCSI_OPCODE_ALLOW_MEDIUM_REMOVAL                          0x1e
#define SCSI_OPCODE_MODE_SENSE_10                                 0x5a
#define SCSI_OPCODE_READ_FORMAT_CAPACITIES                        0x23
#define SCSI_OPCODE_READ_CAPACITY_10                              0x25
#define SCSI_OPCODE_READ_10                                       0x28
#define SCSI_OPCODE_WRITE_10                                      0x2a
#define SCSI_OPCODE_VERIFY_10                                     0x2f

#define SCSI_STATUS_CSW_CMD_PASSED                                0
#define SCSI_STATUS_CSW_CMD_FAILED                                1
#define SCSI_STATUS_DATA                                          3
#define SCSI_STATUS_DATA_IN_CSW_CMD_PASSED                        USBD_BOT_ABORT_DATA_IN_CSW_CMD_PASSED
#define SCSI_STATUS_DATA_IN_CSW_CMD_FAILED                        USBD_BOT_ABORT_DATA_IN_CSW_CMD_FAILED
#define SCSI_STATUS_DATA_IN_CSW_PHASE_ERROR                       USBD_BOT_ABORT_DATA_IN_CSW_PHASE_ERROR
#define SCSI_STATUS_DATA_OUT_CSW_CMD_PASSED                       USBD_BOT_ABORT_DATA_OUT_CSW_CMD_PASSED
#define SCSI_STATUS_DATA_OUT_CSW_CMD_FAILED                       USBD_BOT_ABORT_DATA_OUT_CSW_CMD_FAILED
#define SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR                      USBD_BOT_ABORT_DATA_OUT_CSW_PHASE_ERROR

#define SCSI_DATA_LENGTH_INQUIRE_PAGE_00                          7
#define SCSI_DATA_LENGTH_INQUIRE_STANDARD                         36
#define SCSI_DATA_LENGTH_REQUEST_SENSE                            18
#define SCSI_DATA_LENGTH_MODE_SENSE_6                             4
#define SCSI_DATA_LENGTH_MODE_SENSE_10                            8
#define SCSI_DATA_LENGTH_READ_CAPACITY_10                         8
#define SCSI_DATA_LENGTH_READ_FORMAT_CAPACITIES                   12

#define SCSI_SKEY_NO_SENSE                                        0x00
#define SCSI_SKEY_RECOVERED_ERROR                                 0x01
#define SCSI_SKEY_NOT_READY                                       0x02
#define SCSI_SKEY_MEDIUM_ERROR                                    0x03
#define SCSI_SKEY_HARDWARE_ERROR                                  0x04
#define SCSI_SKEY_ILLEGAL_REQUEST                                 0x05
#define SCSI_SKEY_UNIT_ATTENTION                                  0x06
#define SCSI_SKEY_DATA_PROTECT                                    0x07
#define SCSI_SKEY_BLANK_CHECK                                     0x08
#define SCSI_SKEY_VENDOR_SPECIFIC                                 0x09
#define SCSI_SKEY_ABORTED_COMMAND                                 0x0b
#define SCSI_SKEY_VOLUME_OVERFLOW                                 0x0d
#define SCSI_SKEY_MISCOMPARE                                      0x0e

#define SCSI_ASC_NO_SENSE                                         0x0000
#define SCSI_ASC_NO_SEEK_COMPLETE                                 0x0200
#define SCSI_ASC_WRITE_FAULT                                      0x0300
#define SCSI_ASC_LOGICAL_DRIVE_NOT_READY_BECOMING_READY           0x0401
#define SCSI_ASC_LOGICAL_DRIVE_NOT_READY_INITIALIZATION_REQUIRED  0x0402
#define SCSI_ASC_LOGICAL_UNIT_NOT_READY_FORMAT_IN_PROGRESS        0x0404
#define SCSI_ASC_LOGICAL_DRIVE_NOT_READY_DEVICE_IS_BUSY           0x04FF
#define SCSI_ASC_NO_REFERENCE_POSITION_FOUND                      0x0600
#define SCSI_ASC_LOGICAL_UNIT_COMMUNICATION_FAILURE               0x0800
#define SCSI_ASC_LOGICAL_UNIT_COMMUNICATION_TIMEOUT               0x0801
#define SCSI_ASC_LOGICAL_UNIT_COMMUNICATION_OVERRUN               0x0880
#define SCSI_ASC_ID_CRC_ERROR                                     0x1000
#define SCSI_ASC_UNRECOVERED_READ_ERROR                           0x1100
#define SCSI_ASC_ADDRESS_MARK_NOT_FOUND_FOR_ID_FIELD              0x1200
#define SCSI_ASC_ADDRESS_MARK_NOT_FOUND_FOR_DATA_FIELD            0x1300
#define SCSI_ASC_RECORDED_ENTITY_NOT_FOUND                        0x1400
#define SCSI_ASC_RECOVERED_DATA_WITH_RETRIES                      0x1701
#define SCSI_ASC_RECOVERED_DATA_WITH_ECC                          0x1800
#define SCSI_ASC_PARAMETER_LIST_LENGTH_ERROR                      0x1A00
#define SCSI_ASC_INVALID_COMMAND_OPERATION_CODE                   0x2000
#define SCSI_ASC_LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE               0x2100
#define SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET                  0x2400
#define SCSI_ASC_LOGICAL_UNIT_NOT_SUPPORTED                       0x2500
#define SCSI_ASC_INVALID_FIELD_IN_PARAMETER_LIST                  0x2600
#define SCSI_ASC_PARAMETER_NOT_SUPPORTED                          0x2601
#define SCSI_ASC_PARAMETER_VALUE_INVALID                          0x2602
#define SCSI_ASC_WRITE_PROTECTED_MEDIA                            0x2700
#define SCSI_ASC_NOT_READY_TO_READY_TRANSITION_MEDIA_CHANGED      0x2800
#define SCSI_ASC_POWER_ON_RESET_OR_BUS_DEVICE_RESET_OCCURRED      0x2900
#define SCSI_ASC_COMMANDS_CLEARED_BY_ANOTHER_INITIATOR            0x2F00
#define SCSI_ASC_CANNOT_READ_MEDIUM_UNKNOWN_FORMAT                0x3001
#define SCSI_ASC_FORMAT_COMMAND_FAILED                            0x3101
#define SCSI_ASC_SAVING_PARAMETERS_NOT_SUPPORT                    0x3900
#define SCSI_ASC_MEDIUM_NOT_PRESENT                               0x3A00
#define SCSI_ASC_OVERLAPPED_COMMAND_ATTEMPTED                     0x4E00
#define SCSI_ASC_USB_TO_HOST_SYSTEM_INTERFACE_FAILURE             0x5400
#define SCSI_ASC_INSUFFICIENT_RESOURCES                           0x8000
#define SCSI_ASC_UNKNOWN_ERROR                                    0xFFFF

static void SCSI_ProcessStart(USBD_HandleTypeDef *pdev);
static void SCSI_ProcessStop(USBD_HandleTypeDef *pdev);
static void SCSI_ProcessReset(USBD_HandleTypeDef *pdev);
static void SCSI_ProcessCommand(USBD_HandleTypeDef *pdev);
static void SCSI_ProcessRead(USBD_HandleTypeDef *pdev);
static void SCSI_ProcessWrite(USBD_HandleTypeDef *pdev);

/***********************************************************************************************************************/

#define USBD_BOT_STATE_NONE                     0       /* None */
#define USBD_BOT_STATE_IDLE                     1       /* Idle */
#define USBD_BOT_STATE_RECOVERY_RESET           2       /* Waiting for reset */
#define USBD_BOT_STATE_RECOVERY_DATA_IN         3       /* Waiting for clear feature halt on data in */
#define USBD_BOT_STATE_RECOVERY_DATA_OUT        4       /* Waiting for clear feature halt on data out */
#define USBD_BOT_STATE_HALT_DATA_IN             5       /* Waiting for clear feature halt on data in */
#define USBD_BOT_STATE_HALT_DATA_OUT            6       /* Waiting for clear feature halt on data out */
#define USBD_BOT_STATE_DATA_IN                  7       /* Data In state */
#define USBD_BOT_STATE_DATA_IN_LAST             8       /* Last Data In Last (passed) */
#define USBD_BOT_STATE_DATA_IN_LAST_STALL       9       /* Last Data In Last (failed or phase error) */
#define USBD_BOT_STATE_DATA_OUT                 10      /* Data Out state */

#define USBD_BOT_ABORT_CBW                      3
#define USBD_BOT_ABORT_DATA_IN_CSW_CMD_PASSED   4
#define USBD_BOT_ABORT_DATA_IN_CSW_CMD_FAILED   5
#define USBD_BOT_ABORT_DATA_IN_CSW_PHASE_ERROR  6
#define USBD_BOT_ABORT_DATA_OUT_CSW_CMD_PASSED  7
#define USBD_BOT_ABORT_DATA_OUT_CSW_CMD_FAILED  8
#define USBD_BOT_ABORT_DATA_OUT_CSW_PHASE_ERROR 9
   
#define USBD_BOT_CBW_SIGNATURE                  0x43425355
#define USBD_BOT_CSW_SIGNATURE                  0x53425355
#define USBD_BOT_CBW_LENGTH                     31
#define USBD_BOT_CSW_LENGTH                     13

#define USBD_BOT_CSW_CMD_PASSED                 0
#define USBD_BOT_CSW_CMD_FAILED                 1
#define USBD_BOT_CSW_PHASE_ERROR                2

#define USBD_BOT_GET_MAX_LUN                    0xfe
#define USBD_BOT_RESET                          0xff

static void MSC_BOT_Open(USBD_HandleTypeDef *pdev);
static void MSC_BOT_Close(USBD_HandleTypeDef *pdev);
static void MSC_BOT_Abort(USBD_HandleTypeDef *pdev, uint8_t abort);
static void MSC_BOT_Stall(USBD_HandleTypeDef *pdev, uint8_t epnum);
static void MSC_BOT_ClearHalt(USBD_HandleTypeDef *pdev, uint8_t ep_addr);
static void MSC_BOT_SendCSW(USBD_HandleTypeDef *pdev, uint8_t status);
static void MSC_BOT_Transmit(USBD_HandleTypeDef *pdev, const uint8_t *data, uint32_t length);

