GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
static void MSC_BOT_SetupTransmit(USBD_HandleTypeDef *pdev, uint32_t length);
static void MSC_BOT_ContinueTransmit(USBD_HandleTypeDef *pdev);
static void MSC_BOT_FinishTransmit(USBD_HandleTypeDef *pdev, uint8_t status);

static void MSC_BOT_SetupReceive(USBD_HandleTypeDef *pdev, uint32_t length);
static void MSC_BOT_ContinueReceive(USBD_HandleTypeDef *pdev);
static void MSC_BOT_FinishReceive(USBD_HandleTypeDef *pdev, uint8_t status);

/***********************************************************************************************************************/
/***********************************************************************************************************************/

#define USBD_MSC_QUEUE_ENTRIES   8
#define USBD_MSC_QUEUE_THRESHOLD 4

typedef void (*stm32l0_usbd_msc_routine_t)(USBD_HandleTypeDef*);
   
typedef struct
{
    uint32_t dSignature;
    uint32_t dTag;
    uint32_t dDataLength;
    uint8_t  bmFlags;
    uint8_t  bLUN;
    uint8_t  bCBLength;
    uint8_t  CB[16];
} USBD_MSC_BOT_CBWTypeDef;

typedef struct
{
    uint32_t dSignature;
    uint32_t dTag;
    uint32_t dDataResidue;
    uint8_t  bStatus;
} USBD_MSC_BOT_CSWTypeDef;

typedef struct _stm32l0_usbd_msc_device_t {
    uint8_t                  interface;  
    uint8_t                  max_lun;   
    uint16_t                 feature; 
    const dosfs_storage_interface_t *storage;

    volatile uint32_t        queue_lock;
    armv6m_work_t            queue_work;
    volatile uint32_t        queue_head;
    volatile uint32_t        queue_tail;
    stm32l0_usbd_msc_routine_t queue_data[USBD_MSC_QUEUE_ENTRIES];

    uint8_t                  bot_state;
    bool                     bot_fault;
    uint8_t                  bot_data[18]; // should be SCSI_DATA_LENGTH_REQUEST_SENSE
    USBD_MSC_BOT_CBWTypeDef  bot_cbw;
    USBD_MSC_BOT_CSWTypeDef  bot_csw;

    volatile uint8_t         bot_count;
    uint8_t                  bot_index;
    volatile uint8_t         bot_rx_busy;
    volatile uint8_t         bot_tx_busy;
    volatile uint32_t        bot_rx_length;
    volatile uint32_t        bot_tx_length;
  
    uint8_t                  scsi_sense_skey;
    uint16_t                 scsi_sense_asc;
    uint32_t                 scsi_sense_address;
    uint32_t                 scsi_blk_count;
    uint32_t                 scsi_blk_size;
    uint32_t                 scsi_blk_address;
    uint32_t                 scsi_blk_length;
    uint32_t                 scsi_blk_queue;
    uint8_t                  scsi_blk_fault;
    bool                     scsi_blk_busy;

    uint32_t                 scsi_index;
    uint8_t                  *scsi_data[2];
    const uint8_t            *scsi_inquiry_data;
} stm32l0_usbd_msc_device_t;

static stm32l0_usbd_msc_device_t stm32l0_usbd_msc_device;

/***********************************************************************************************************************/

/*
 * This code is more complex than expected. USB/MSC uses really only one logical connection
 * over 2 pipe. First the host sends a CBW (Command Block Wrapper), then optionally data is
 * exchanged, then finally the device sends a CSW (Command Status Wrapper) back. If there
 * a mismatch between what the host or devices expects one has to properly resync. If the
 * the CBW is invalid, the device stalls both IN and OUT pipe. If the host expects to
 * receive data, the IN pipe gets stalled, and if the host expects to send data the OUT
 * pipe gets stalled. If both pipes are stalled, the host issues a reset sequence
 * (reset token, then clear halt on IN, then clear halt on OUT). Otherwise the halt on
 * IN or OUT are cleared as needed. When that is done, the devices sends the CSV.
 *
 * The spec lays this out in terms of Hi (host receives), Ho (host wants to send) and
 * Hn (host neither wants to receiver or send). Same for the device, Di, Do, Dn.
 *
 * Hi, Ho & Hn are coded in the CBW:
 *
 * if (dCBWDataTransferLength == 0) {
 *     Hn;
 * } else {
 *     if (bmCBWFlags & 0x80) {
 *         Hi(dCBWDataTransferLength);
 *     } else {
 *         Ho(dCBWDataTransferLength);
 *     }
 * }
 *
 * For the device side it dependends up the command:
 *
 * TEST_UNIT_READY           Dn
 * START_STOP_UNIT           Dn
 * ALLOW_MEDIUM_REMOVAL      Dn
 * REQUEST_SENSE             Do (Dn if "Allocation Length" is 0)
 * INQUIRY                   Do (Dn if "Allocation Length" is 0)
 * MODE_SENSE_6              Do
 * MODE_SENSE_10 *           Do
 * READ_FORMAT_CAPACITIES *  Do (Dn if "Allocation Length" is 0)
 * READ_CAPACITY_10          Do
 * READ_10                   Do (Dn if "Transfer Length" is 0)
 * WRITE_10                  Di (Dn if "Transfer Length" is 0)
 * VERIFY_10                 Dn
 * <illegal command>         Dn
 *
 * In general up to dCBWDataTransferLength get transferred; if there is less data, less gets
 * transfered, and dCSWDataResidue contains the delta.
 *
 * The spec identifies 13 cases:
 *
 *                  CSW               STALL     HOST            BOT STATE
 *  (1) Hn = Dn     PASSED / FAILED   -         -               IDLE
 *  (2) Hn < Di     PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (3) Hn < Do     PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (4) Hi > Dn     PASSED / FAILED   DATA_IN   -               HALT_DATA_IN
 *  (5) Hi > Di     PASSED / FAILED   DATA_IN   -               HALT_DATA_IN
 *  (6) Hi = Di     PASSED / FAILED   -         -               IDLE
 *  (7) Hi < Di     PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (8) Hi <> Do    PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (9) Ho > Dn     PASSED / FAILED   DATA_OUT  -               HALT_DATA_OUT
 * (10) Ho <> Di    PHASE_ERROR       DATA_OUT  RESET_RECOVERY  RECOVERY_RESET
 * (11) Ho > Do     PASSED / FAILED   DATA_OUT  -               HALT_DATA_OUT
 * (12) Ho = Do     PASSED / FAILED   -         -               IDLE
 * (13) Ho < Do     PHASE_ERROR       DATA_OUT  RESET_RECOVERY  RECOVERY_RESET
 *
 * The spec does not say what CSW to send on a invalid CBW. Bot stalled are DATA_IN/DATA_OUT
 * followed by a RESET_RECOVERY.
 */

