GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
static void SCSI_SenseCode(USBD_HandleTypeDef *pdev, uint8_t SKey, uint16_t ASC, uint32_t blk_address)
{
    stm32l0_usbd_msc_device.scsi_sense_skey = SKey;
    stm32l0_usbd_msc_device.scsi_sense_asc = ASC;
    stm32l0_usbd_msc_device.scsi_sense_address = blk_address;
}

static int SCSI_CommandPassed(USBD_HandleTypeDef *pdev)
{
    if (stm32l0_usbd_msc_device.bot_cbw.dDataLength != 0)
    {
        if (stm32l0_usbd_msc_device.bot_cbw.bmFlags & 0x80)
        {
            /* case (4) Hi > Dn */
            return SCSI_STATUS_DATA_IN_CSW_CMD_PASSED;
        }
        else
        {
            /* case (9) Ho > Dn */
            return SCSI_STATUS_DATA_OUT_CSW_CMD_PASSED;
        }
    }  
    else
    {
        /* case (1) Hn = Dn */
        return SCSI_STATUS_CSW_CMD_PASSED;
    }
}

static int SCSI_CommandFailed(USBD_HandleTypeDef *pdev, uint8_t SKey, uint16_t ASC, uint32_t blk_address)
{
    SCSI_SenseCode(pdev, SKey, ASC, blk_address);

    if (stm32l0_usbd_msc_device.bot_cbw.dDataLength == 0)
    {
        /* case (1) Hn = Dn */
        return SCSI_STATUS_CSW_CMD_FAILED;
    }
    else
    {
        if (stm32l0_usbd_msc_device.bot_cbw.bmFlags & 0x80)
        {
            /* case (4) Hi > Dn */
            return SCSI_STATUS_DATA_IN_CSW_CMD_FAILED;
        }
        else
        {
            /* case (9) Ho > Dn */
            return SCSI_STATUS_DATA_OUT_CSW_CMD_FAILED;
        }
    }
}

static bool SCSI_CheckLength(USBD_HandleTypeDef *pdev, uint32_t length, int *p_status)
{
    if (stm32l0_usbd_msc_device.bot_cbw.dDataLength == 0)
    {
        /* case (1) Hn = Dn */
        *p_status = SCSI_STATUS_CSW_CMD_PASSED;

        return false;
    }
    else
    {
        if (!(stm32l0_usbd_msc_device.bot_cbw.bmFlags & 0x80))
        {
            /* case (10) Ho <> Di */
            *p_status = SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR;
                
            return false;
        }
    }

    return true;
}

static bool SCSI_CheckAllocation(USBD_HandleTypeDef *pdev, uint32_t allocation, uint32_t length, int *p_status)
{
    if (allocation)
    {
        if (stm32l0_usbd_msc_device.bot_cbw.dDataLength == 0)
        {
            /* case (2) Hn < Di */
            *p_status = SCSI_STATUS_DATA_IN_CSW_PHASE_ERROR;

            return false;
        }
        else
        {
            if (stm32l0_usbd_msc_device.bot_cbw.bmFlags & 0x80)
            {
                if (stm32l0_usbd_msc_device.bot_cbw.dDataLength != allocation)
                {
                    *p_status = SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);

                    return false;
                }
            }
            else
            {
                /* case (10) Ho <> Di */
                *p_status = SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR;
                
                return false;
            }
        }
    }
    else
    {
        if (stm32l0_usbd_msc_device.bot_cbw.dDataLength == 0)
        {
            /* case (1) Hn = Dn */
            *p_status =SCSI_STATUS_CSW_CMD_PASSED;
        }
        else
        {
            if (stm32l0_usbd_msc_device.bot_cbw.bmFlags & 0x80)
            {
                /* case (4) Hi > Dn */
                *p_status = SCSI_STATUS_DATA_IN_CSW_CMD_PASSED;
            }
            else
            {
                /* case (9) Ho > Dn */
                *p_status = SCSI_STATUS_DATA_OUT_CSW_CMD_PASSED;
            }
        }

        return false;
    }

    return true;
}

static int SCSI_TestUnitReady(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    if (!stm32l0_usbd_msc_device.storage->IsReady())
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    return SCSI_CommandPassed(pdev);
}

static int SCSI_StartStopUnit(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    if (!stm32l0_usbd_msc_device.storage->StartStopUnit(((params[4] >> 0) & 1), ((params[4] >> 1) & 1)))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    }
    
    return SCSI_CommandPassed(pdev);
}

static int SCSI_AllowMediumRemoval(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    if (!stm32l0_usbd_msc_device.storage->PreventAllowMediumRemoval((params[4] >> 0) & 1))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    return SCSI_CommandPassed(pdev);
}

static int SCSI_Inquiry(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    const uint8_t *data;
    uint32_t length, allocation;
    int status;
    
    allocation = params[4];

    if (params[1] & 0x01)
    {
        stm32l0_usbd_msc_device.bot_data[0]  = 0x00;
        stm32l0_usbd_msc_device.bot_data[1]  = 0x00;
        stm32l0_usbd_msc_device.bot_data[2]  = 0x00;
        stm32l0_usbd_msc_device.bot_data[3]  = 0x03;
        stm32l0_usbd_msc_device.bot_data[4]  = 0x00;
        stm32l0_usbd_msc_device.bot_data[5]  = 0x00;
        stm32l0_usbd_msc_device.bot_data[6]  = 0x80;
        stm32l0_usbd_msc_device.bot_data[7]  = 0x83;

        data = &(stm32l0_usbd_msc_device.bot_data[0]);

        length = SCSI_DATA_LENGTH_INQUIRE_PAGE_00;
    }
    else
    {
        data = (const uint8_t *)stm32l0_usbd_msc_device.scsi_inquiry_data;

        length = data[4] + 5;
    }

    if (!SCSI_CheckAllocation(pdev, allocation, length, &status))
    {
        return status;
    }

    armv6m_svcall_3((uint32_t)&MSC_BOT_Transmit, (uint32_t)pdev, (uint32_t)data, (uint32_t)MIN(allocation, length));
    
    return SCSI_STATUS_DATA;
}

static int SCSI_RequestSense(USBD_HandleTypeDef  *pdev, const uint8_t *params)
{
    uint32_t allocation;
    int status;
    
    allocation = params[4];
    
    stm32l0_usbd_msc_device.bot_data[0]  = 0x70;
    stm32l0_usbd_msc_device.bot_data[1]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[2]  = stm32l0_usbd_msc_device.scsi_sense_skey;
    stm32l0_usbd_msc_device.bot_data[3]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[4]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[5]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[6]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[7]  = 0x0a;
    stm32l0_usbd_msc_device.bot_data[8]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[9]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[10] = 0x00;
    stm32l0_usbd_msc_device.bot_data[11] = 0x00;
    stm32l0_usbd_msc_device.bot_data[12] = (uint8_t)(stm32l0_usbd_msc_device.scsi_sense_asc >> 8);
    stm32l0_usbd_msc_device.bot_data[13] = (uint8_t)(stm32l0_usbd_msc_device.scsi_sense_asc >> 0);
    stm32l0_usbd_msc_device.bot_data[14] = 0x00;
    stm32l0_usbd_msc_device.bot_data[15] = 0x00;
    stm32l0_usbd_msc_device.bot_data[16] = 0x00;
    stm32l0_usbd_msc_device.bot_data[17] = 0x00;

    if (stm32l0_usbd_msc_device.scsi_sense_skey == SCSI_SKEY_HARDWARE_ERROR)
    {
        stm32l0_usbd_msc_device.bot_data[0] |= 0x80;

        stm32l0_usbd_msc_device.bot_data[3]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_sense_address >> 24);
        stm32l0_usbd_msc_device.bot_data[4]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_sense_address >> 16);
        stm32l0_usbd_msc_device.bot_data[5]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_sense_address >>  8);
        stm32l0_usbd_msc_device.bot_data[6]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_sense_address >>  0);
    }

    stm32l0_usbd_msc_device.scsi_sense_skey = SCSI_SKEY_NO_SENSE;
    stm32l0_usbd_msc_device.scsi_sense_asc = SCSI_ASC_NO_SENSE;
    stm32l0_usbd_msc_device.scsi_sense_address = 0;
    
    if (!SCSI_CheckAllocation(pdev, allocation, SCSI_DATA_LENGTH_REQUEST_SENSE, &status))
    {
        return status;
    }

    armv6m_svcall_3((uint32_t)&MSC_BOT_Transmit, (uint32_t)pdev, (uint32_t)stm32l0_usbd_msc_device.bot_data, (uint32_t)MIN(allocation, SCSI_DATA_LENGTH_REQUEST_SENSE));
    
    return SCSI_STATUS_DATA;
}

static int SCSI_ModeSense6(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    bool write_protected;
    int status;

    if (!stm32l0_usbd_msc_device.storage->GetWriteProtected(&write_protected))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    stm32l0_usbd_msc_device.bot_data[0]  = 0x03;
    stm32l0_usbd_msc_device.bot_data[1]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[2]  = write_protected ? 0x80 : 0x00;
    stm32l0_usbd_msc_device.bot_data[3]  = 0x00;

