GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
    if (!SCSI_CheckLength(pdev, SCSI_DATA_LENGTH_MODE_SENSE_6, &status))
    {
        return status;
    }

    armv6m_svcall_3((uint32_t)&MSC_BOT_Transmit, (uint32_t)pdev, (uint32_t)stm32l0_usbd_msc_device.bot_data, (uint32_t)SCSI_DATA_LENGTH_MODE_SENSE_6);
        
    return SCSI_STATUS_DATA;
}

static int SCSI_ModeSense10(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    bool write_protected;
    int status;
    
    if (!stm32l0_usbd_msc_device.storage->GetWriteProtected(&write_protected))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    stm32l0_usbd_msc_device.bot_data[0]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[1]  = 0x06;
    stm32l0_usbd_msc_device.bot_data[2]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[3]  = write_protected ? 0x80 : 0x00;
    stm32l0_usbd_msc_device.bot_data[4]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[5]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[6]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[7]  = 0x00;
    
    if (!SCSI_CheckLength(pdev, SCSI_DATA_LENGTH_MODE_SENSE_10, &status))
    {
        return status;
    }

    armv6m_svcall_3((uint32_t)&MSC_BOT_Transmit, (uint32_t)pdev, (uint32_t)stm32l0_usbd_msc_device.bot_data, (uint32_t)SCSI_DATA_LENGTH_MODE_SENSE_10);

    return SCSI_STATUS_DATA;
}

static int SCSI_ReadFormatCapacities(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    uint32_t allocation;
    int status;
    
    allocation = (params[7] << 8) | (params[8]);

    stm32l0_usbd_msc_device.bot_data[0]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[1]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[2]  = 0x00;
    stm32l0_usbd_msc_device.bot_data[3]  = 0x08;
    stm32l0_usbd_msc_device.bot_data[4]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_count >> 24);
    stm32l0_usbd_msc_device.bot_data[5]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_count >> 16);
    stm32l0_usbd_msc_device.bot_data[6]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_count >>  8);
    stm32l0_usbd_msc_device.bot_data[7]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_count >>  0);
    stm32l0_usbd_msc_device.bot_data[8]  = 0x02;
    stm32l0_usbd_msc_device.bot_data[9]  = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_size >> 16);
    stm32l0_usbd_msc_device.bot_data[10] = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_size >>  8);
    stm32l0_usbd_msc_device.bot_data[11] = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_size >>  0);
    
    if (!SCSI_CheckAllocation(pdev, allocation, SCSI_DATA_LENGTH_READ_FORMAT_CAPACITIES, &status))
    {
        return status;
    }

    armv6m_svcall_3((uint32_t)&MSC_BOT_Transmit, (uint32_t)pdev, (uint32_t)stm32l0_usbd_msc_device.bot_data, (uint32_t)MIN(allocation, SCSI_DATA_LENGTH_READ_FORMAT_CAPACITIES));
    
    return SCSI_STATUS_DATA;
}

static int SCSI_ReadCapacity10(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    int status;
    
    if (!stm32l0_usbd_msc_device.storage->GetCapacity(&stm32l0_usbd_msc_device.scsi_blk_count, &stm32l0_usbd_msc_device.scsi_blk_size))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    stm32l0_usbd_msc_device.bot_data[0] = (uint8_t)((stm32l0_usbd_msc_device.scsi_blk_count -1) >> 24);
    stm32l0_usbd_msc_device.bot_data[1] = (uint8_t)((stm32l0_usbd_msc_device.scsi_blk_count -1) >> 16);
    stm32l0_usbd_msc_device.bot_data[2] = (uint8_t)((stm32l0_usbd_msc_device.scsi_blk_count -1) >>  8);
    stm32l0_usbd_msc_device.bot_data[3] = (uint8_t)((stm32l0_usbd_msc_device.scsi_blk_count -1) >>  0);
    stm32l0_usbd_msc_device.bot_data[4] = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_size >> 24);
    stm32l0_usbd_msc_device.bot_data[5] = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_size >> 16);
    stm32l0_usbd_msc_device.bot_data[6] = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_size >>  8);
    stm32l0_usbd_msc_device.bot_data[7] = (uint8_t)(stm32l0_usbd_msc_device.scsi_blk_size >>  0);

    if (!SCSI_CheckLength(pdev, SCSI_DATA_LENGTH_READ_CAPACITY_10, &status))
    {
        return status;
    }

    armv6m_svcall_3((uint32_t)&MSC_BOT_Transmit, (uint32_t)pdev, (uint32_t)stm32l0_usbd_msc_device.bot_data, (uint32_t)SCSI_DATA_LENGTH_READ_CAPACITY_10);
    
    return SCSI_STATUS_DATA;
}

static int SCSI_Read10(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    bool changed;

    stm32l0_usbd_msc_device.scsi_blk_address = (params[2] << 24) | (params[3] << 16) | (params[4] << 8) | (params[5] << 0);
    stm32l0_usbd_msc_device.scsi_blk_length = (params[7] << 8) | (params[8] << 0);
    
    /* Check in Media is changed */
    if (!stm32l0_usbd_msc_device.storage->GetChanged(&changed))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (changed)
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_UNIT_ATTENTION, SCSI_ASC_NOT_READY_TO_READY_TRANSITION_MEDIA_CHANGED, 0);
    } 
    
    if (stm32l0_usbd_msc_device.scsi_blk_count == 0)
    {
        if (!stm32l0_usbd_msc_device.storage->GetCapacity(&stm32l0_usbd_msc_device.scsi_blk_count, &stm32l0_usbd_msc_device.scsi_blk_size))
        {
            return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 
    }
    
    /* Check address range */
    if ((stm32l0_usbd_msc_device.scsi_blk_address + stm32l0_usbd_msc_device.scsi_blk_length) > stm32l0_usbd_msc_device.scsi_blk_count)
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE, 0);
    }

    if (stm32l0_usbd_msc_device.bot_cbw.dDataLength != (stm32l0_usbd_msc_device.scsi_blk_length * stm32l0_usbd_msc_device.scsi_blk_size))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);
    }

    if (stm32l0_usbd_msc_device.scsi_blk_length == 0)
    {
        return SCSI_CommandPassed(pdev);
    }
    else
    {
        if (!(stm32l0_usbd_msc_device.bot_cbw.bmFlags & 0x80))
        {
            /* case (10) Ho <> Di */
            return SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR;
        }

        /* Acquire Media Lock */
        if (!stm32l0_usbd_msc_device.storage->Acquire())
        {
            return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 

