GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
        stm32l0_usbd_msc_device.scsi_blk_queue = 0;
        stm32l0_usbd_msc_device.scsi_blk_fault = false;
        stm32l0_usbd_msc_device.scsi_blk_busy = true;

        stm32l0_usbd_msc_device.scsi_index = 0;

        if (!stm32l0_usbd_msc_device.storage->Read(stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.scsi_index], stm32l0_usbd_msc_device.scsi_blk_address, 1, (stm32l0_usbd_msc_device.scsi_blk_length == 1)))
        {
            SCSI_CommandFailed(pdev, SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_UNRECOVERED_READ_ERROR, stm32l0_usbd_msc_device.scsi_blk_address);

	    stm32l0_usbd_msc_device.scsi_blk_fault = true;
	}

        armv6m_svcall_2((uint32_t)&MSC_BOT_SetupTransmit, (uint32_t)pdev, (uint32_t)stm32l0_usbd_msc_device.scsi_blk_length);
	
        stm32l0_usbd_msc_device.scsi_blk_queue += 1;
        stm32l0_usbd_msc_device.scsi_index ^= 1;

        stm32l0_usbd_msc_device.scsi_blk_address += 1;
        stm32l0_usbd_msc_device.scsi_blk_length -= 1;

	if (stm32l0_usbd_msc_device.scsi_blk_length != 0)
	{
	    if (!stm32l0_usbd_msc_device.scsi_blk_fault)
	    {
		if (!stm32l0_usbd_msc_device.storage->Read(stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.scsi_index], stm32l0_usbd_msc_device.scsi_blk_address, 1, (stm32l0_usbd_msc_device.scsi_blk_length == 1)))
		{
		    SCSI_CommandFailed(pdev, SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_UNRECOVERED_READ_ERROR, stm32l0_usbd_msc_device.scsi_blk_address);
		    
		    stm32l0_usbd_msc_device.scsi_blk_fault = true;
		}
	    }
	    
	    armv6m_svcall_1((uint32_t)&MSC_BOT_ContinueTransmit, (uint32_t)pdev);
	    
	    stm32l0_usbd_msc_device.scsi_blk_queue += 1;
	    stm32l0_usbd_msc_device.scsi_index ^= 1;
	    
	    stm32l0_usbd_msc_device.scsi_blk_address += 1;
	    stm32l0_usbd_msc_device.scsi_blk_length -= 1;
	}
	
        return SCSI_STATUS_DATA;
    }
}

static int SCSI_Write10(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    bool write_protected, changed;

    stm32l0_usbd_msc_device.scsi_blk_address = (params[2] << 24) | (params[3] << 16) | (params[4] << 8) | (params[5] << 0);
    stm32l0_usbd_msc_device.scsi_blk_length = (params[7] << 8) | (params[8] << 0);

    /* Check in Media is changed */
    if (!stm32l0_usbd_msc_device.storage->GetChanged(&changed))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (changed)
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_UNIT_ATTENTION, SCSI_ASC_NOT_READY_TO_READY_TRANSITION_MEDIA_CHANGED, 0);
    } 
    
    /* Check If media is write-protected */
    if (!stm32l0_usbd_msc_device.storage->GetWriteProtected(&write_protected))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (write_protected)
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_WRITE_PROTECTED_MEDIA, 0);
    } 

    if (stm32l0_usbd_msc_device.scsi_blk_count == 0)
    {
        if (!stm32l0_usbd_msc_device.storage->GetCapacity(&stm32l0_usbd_msc_device.scsi_blk_count, &stm32l0_usbd_msc_device.scsi_blk_size))
        {
            return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 
    }
    
    /* Check address range */
    if ((stm32l0_usbd_msc_device.scsi_blk_address + stm32l0_usbd_msc_device.scsi_blk_length) > stm32l0_usbd_msc_device.scsi_blk_count)
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE, 0);
    }

    if (stm32l0_usbd_msc_device.bot_cbw.dDataLength != (stm32l0_usbd_msc_device.scsi_blk_length * stm32l0_usbd_msc_device.scsi_blk_size))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);
    }

    if (stm32l0_usbd_msc_device.scsi_blk_length == 0)
    {
        return SCSI_CommandPassed(pdev);
    }
    else
    {
        if (stm32l0_usbd_msc_device.bot_cbw.bmFlags & 0x80)
        {
            /* case (8) Hi <> Do */
            return SCSI_STATUS_DATA_IN_CSW_PHASE_ERROR;
        }

        /* Acquire Media Lock */
        if (!stm32l0_usbd_msc_device.storage->Acquire())
        {
            return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 

	stm32l0_usbd_msc_device.scsi_blk_queue = 0;
        stm32l0_usbd_msc_device.scsi_blk_fault = false;
        stm32l0_usbd_msc_device.scsi_blk_busy = true;

        stm32l0_usbd_msc_device.scsi_index = 0;
	
        armv6m_svcall_2((uint32_t)&MSC_BOT_SetupReceive, (uint32_t)pdev, (uint32_t)stm32l0_usbd_msc_device.scsi_blk_length);

        return SCSI_STATUS_DATA;
    }
}

static int SCSI_Verify10(USBD_HandleTypeDef *pdev, const uint8_t *params)
{
    uint32_t blk_address, blk_length;
    bool changed;

    blk_address = (params[2] << 24) | (params[3] << 16) | (params[4] << 8) | (params[5] << 0);
    blk_length = (params[7] << 8) | (params[8] << 0);

    if ((params[1] & 0x02) == 0x02) 
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);
    }

    /* Check in Media is changed */
    if (!stm32l0_usbd_msc_device.storage->GetChanged(&changed))
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (changed)
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_UNIT_ATTENTION, SCSI_ASC_NOT_READY_TO_READY_TRANSITION_MEDIA_CHANGED, 0);
    } 
    
    if (stm32l0_usbd_msc_device.scsi_blk_count == 0)
    {
        if (!stm32l0_usbd_msc_device.storage->GetCapacity(&stm32l0_usbd_msc_device.scsi_blk_count, &stm32l0_usbd_msc_device.scsi_blk_size))
        {
            return SCSI_CommandFailed(pdev, SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 
    }
    
    /* Check address range */
    if ((blk_address + blk_length) > stm32l0_usbd_msc_device.scsi_blk_count)
    {
        return SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE, 0);
    }

    return SCSI_CommandPassed(pdev);
}

static void SCSI_ProcessStart(USBD_HandleTypeDef *pdev)
{
    uint8_t *cache_data;
    const uint8_t *inquiry_data;
    
    stm32l0_usbd_msc_device.storage->Init(&cache_data, &inquiry_data);

    stm32l0_usbd_msc_device.scsi_sense_skey = SCSI_SKEY_NO_SENSE;
    stm32l0_usbd_msc_device.scsi_sense_asc = SCSI_ASC_NO_SENSE;
    stm32l0_usbd_msc_device.scsi_sense_address = 0;

    stm32l0_usbd_msc_device.scsi_blk_size = 0;
    stm32l0_usbd_msc_device.scsi_blk_count = 0;
    stm32l0_usbd_msc_device.scsi_blk_address = 0;
    stm32l0_usbd_msc_device.scsi_blk_length = 0;
    stm32l0_usbd_msc_device.scsi_blk_fault = 0;
    stm32l0_usbd_msc_device.scsi_blk_busy = false;

