GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
    stm32l0_usbd_msc_device.scsi_index = 0;
    stm32l0_usbd_msc_device.scsi_data[0] = cache_data;
    stm32l0_usbd_msc_device.scsi_data[1] = cache_data + MSC_MEDIA_PACKET;

    stm32l0_usbd_msc_device.scsi_inquiry_data = inquiry_data;
    
}

static void SCSI_ProcessStop(USBD_HandleTypeDef *pdev)
{
    stm32l0_usbd_msc_device.storage->StartStopUnit(true, false);
    
    stm32l0_usbd_msc_device.storage->DeInit();
}

static void SCSI_ProcessReset(USBD_HandleTypeDef *pdev)
{
    stm32l0_usbd_msc_device.scsi_blk_fault = false;
    stm32l0_usbd_msc_device.scsi_blk_busy = false;
}

static void SCSI_ProcessCommand(USBD_HandleTypeDef *pdev)
{
    const uint8_t *params = (const uint8_t*)&stm32l0_usbd_msc_device.bot_cbw.CB[0];
    int status;

    switch (params[0]) {
    case SCSI_OPCODE_TEST_UNIT_READY:
        status = SCSI_TestUnitReady(pdev, params);
        break;
        
    case SCSI_OPCODE_START_STOP_UNIT:
        status = SCSI_StartStopUnit(pdev, params);
        break;
    
    case SCSI_OPCODE_ALLOW_MEDIUM_REMOVAL:
        status = SCSI_AllowMediumRemoval(pdev, params);
        break;
    
    case SCSI_OPCODE_INQUIRY:
        status = SCSI_Inquiry(pdev, params);
        break;
    
    case SCSI_OPCODE_REQUEST_SENSE:
        status = SCSI_RequestSense(pdev, params);
        break;

    case SCSI_OPCODE_MODE_SENSE_6:
        status = SCSI_ModeSense6(pdev, params);
        break;

    case SCSI_OPCODE_MODE_SENSE_10:
        status = SCSI_ModeSense10(pdev, params);
        break;
        
    case SCSI_OPCODE_READ_FORMAT_CAPACITIES:
        status = SCSI_ReadFormatCapacities(pdev, params);
        break;
        
    case SCSI_OPCODE_READ_CAPACITY_10:
        status = SCSI_ReadCapacity10(pdev, params);
        break;
    
    case SCSI_OPCODE_READ_10:
        status = SCSI_Read10(pdev, params); 
        break;
    
    case SCSI_OPCODE_WRITE_10:
        status = SCSI_Write10(pdev, params);
        break;
    
    case SCSI_OPCODE_VERIFY_10:
        status = SCSI_Verify10(pdev, params);
        break;

    default:
        status = SCSI_CommandFailed(pdev, SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_COMMAND_OPERATION_CODE, 0);
        break;
    }

    switch (status) {
    case SCSI_STATUS_CSW_CMD_PASSED:
    case SCSI_STATUS_CSW_CMD_FAILED:
        armv6m_svcall_2((int32_t)&MSC_BOT_SendCSW, (uint32_t)pdev, (uint32_t)status);
        break;

    case SCSI_STATUS_DATA:
        break;

    case SCSI_STATUS_DATA_IN_CSW_CMD_PASSED:
    case SCSI_STATUS_DATA_IN_CSW_CMD_FAILED:
    case SCSI_STATUS_DATA_IN_CSW_PHASE_ERROR:
    case SCSI_STATUS_DATA_OUT_CSW_CMD_PASSED:
    case SCSI_STATUS_DATA_OUT_CSW_CMD_FAILED:
    case SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR:
        armv6m_svcall_2((uint32_t)&MSC_BOT_Abort, (uint32_t)pdev, (uint32_t)status);
        break;

    default:
        break;
    }
}

static void SCSI_ProcessRead(USBD_HandleTypeDef *pdev)
{
    if (!stm32l0_usbd_msc_device.scsi_blk_busy)
    {
        /* Reset while read ... */
        return;
    }

    stm32l0_usbd_msc_device.scsi_blk_queue -= 1;

    if (stm32l0_usbd_msc_device.scsi_blk_length == 0)
    {
	if (stm32l0_usbd_msc_device.scsi_blk_queue == 0)
	{
	    armv6m_svcall_2((uint32_t)&MSC_BOT_FinishTransmit, (uint32_t)pdev, (stm32l0_usbd_msc_device.scsi_blk_fault ? USBD_BOT_CSW_CMD_FAILED : USBD_BOT_CSW_CMD_PASSED));

	    stm32l0_usbd_msc_device.scsi_blk_fault = false;
	    stm32l0_usbd_msc_device.scsi_blk_busy = false;
	}
    }
    else
    {
	do
	{
	    if (!stm32l0_usbd_msc_device.scsi_blk_fault)
	    {
		if (!stm32l0_usbd_msc_device.storage->Read(stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.scsi_index], stm32l0_usbd_msc_device.scsi_blk_address, 1, (stm32l0_usbd_msc_device.scsi_blk_length == 1)))
		{
		    SCSI_CommandFailed(pdev, SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_UNRECOVERED_READ_ERROR, stm32l0_usbd_msc_device.scsi_blk_address);
		    
		    stm32l0_usbd_msc_device.scsi_blk_fault = true;
		}
	    }
	    
	    armv6m_svcall_1((uint32_t)&MSC_BOT_ContinueTransmit, (uint32_t)pdev);

	    stm32l0_usbd_msc_device.scsi_blk_queue += 1;
	    stm32l0_usbd_msc_device.scsi_index ^= 1;
	    
	    stm32l0_usbd_msc_device.scsi_blk_address += 1;
	    stm32l0_usbd_msc_device.scsi_blk_length -= 1;
	}
	while ((stm32l0_usbd_msc_device.scsi_blk_length != 0) && (stm32l0_usbd_msc_device.scsi_blk_queue < USBD_MSC_QUEUE_THRESHOLD) && (stm32l0_usbd_msc_device.bot_count != 2));
    }
}

static void SCSI_ProcessWrite(USBD_HandleTypeDef *pdev)
{
    if (!stm32l0_usbd_msc_device.scsi_blk_busy)
    {
        /* Reset while read ... */
        return;
    }

    stm32l0_usbd_msc_device.bot_csw.dDataResidue -= stm32l0_usbd_msc_device.scsi_blk_size;
    
    if (!stm32l0_usbd_msc_device.scsi_blk_fault)
    {
	if (!stm32l0_usbd_msc_device.storage->Write(stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.scsi_index], stm32l0_usbd_msc_device.scsi_blk_address, 1, true))
        {
            SCSI_SenseCode(pdev, SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_WRITE_FAULT, stm32l0_usbd_msc_device.scsi_blk_address);

	    stm32l0_usbd_msc_device.scsi_blk_fault = true;
	}
    }
    
    stm32l0_usbd_msc_device.scsi_blk_address += 1;
    stm32l0_usbd_msc_device.scsi_blk_length -= 1;
    
    stm32l0_usbd_msc_device.scsi_index ^= 1;

    if (stm32l0_usbd_msc_device.scsi_blk_length == 0)
    {
	armv6m_svcall_2((uint32_t)&MSC_BOT_FinishReceive, (uint32_t)pdev, (stm32l0_usbd_msc_device.scsi_blk_fault ? USBD_BOT_CSW_CMD_FAILED : USBD_BOT_CSW_CMD_PASSED));

	stm32l0_usbd_msc_device.scsi_blk_fault = false;
	stm32l0_usbd_msc_device.scsi_blk_busy = false;

    }
    else
    {
	armv6m_svcall_1((uint32_t)&MSC_BOT_ContinueReceive, (uint32_t)pdev);
    }
}

/***********************************************************************************************************************/

static void MSC_BOT_Init(USBD_HandleTypeDef *pdev)
{
    armv6m_svcall_1((uint32_t)&MSC_BOT_Open, (uint32_t)pdev);

    stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_IDLE;
    
    SCSI_ProcessStart(pdev);
}

