GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
static void MSC_BOT_DeInit(USBD_HandleTypeDef *pdev)
{
    SCSI_ProcessStop(pdev);

    stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_NONE;

    armv6m_svcall_1((uint32_t)&MSC_BOT_Close, (uint32_t)pdev);
}

static void MSC_BOT_DataIn(USBD_HandleTypeDef *pdev)
{
    switch (stm32l0_usbd_msc_device.bot_state) {
    case USBD_BOT_STATE_DATA_IN:
        SCSI_ProcessRead(pdev);
        break;
    
    case USBD_BOT_STATE_DATA_IN_LAST:
        armv6m_svcall_2((uint32_t)&MSC_BOT_SendCSW, (uint32_t)pdev, (uint32_t)USBD_BOT_CSW_CMD_PASSED);
        break;

    case USBD_BOT_STATE_DATA_IN_LAST_STALL:
	armv6m_svcall_2((uint32_t)&MSC_BOT_Stall, (uint32_t)pdev, (uint32_t)STM32L0_USBD_MSC_DATA_IN_EP_ADDR);

        if (stm32l0_usbd_msc_device.bot_csw.bStatus == USBD_BOT_CSW_PHASE_ERROR)
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_RECOVERY_RESET;
        }
        else
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_HALT_DATA_IN;
        }
        break;
        
    default:
        break;
    }
}

static void MSC_BOT_DataCBW(USBD_HandleTypeDef *pdev)
{
    if (stm32l0_usbd_msc_device.bot_state == USBD_BOT_STATE_IDLE)
    {
        stm32l0_usbd_msc_device.bot_csw.dSignature = USBD_BOT_CSW_SIGNATURE;
        stm32l0_usbd_msc_device.bot_csw.dTag = stm32l0_usbd_msc_device.bot_cbw.dTag;
        stm32l0_usbd_msc_device.bot_csw.dDataResidue = stm32l0_usbd_msc_device.bot_cbw.dDataLength;
	
        if ((USBD_LL_GetRxDataSize(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR) != USBD_BOT_CBW_LENGTH) ||
            (stm32l0_usbd_msc_device.bot_cbw.dSignature != USBD_BOT_CBW_SIGNATURE) ||
            (stm32l0_usbd_msc_device.bot_cbw.bLUN > stm32l0_usbd_msc_device.max_lun) || 
            (stm32l0_usbd_msc_device.bot_cbw.bCBLength == 0) || 
            (stm32l0_usbd_msc_device.bot_cbw.bCBLength > 16))
        {
	    armv6m_svcall_2((uint32_t)&MSC_BOT_Abort, (uint32_t)pdev, USBD_BOT_ABORT_CBW);
        }
        else
        {
            SCSI_ProcessCommand(pdev);
        }
    }
}

static void MSC_BOT_DataTransmit(USBD_HandleTypeDef *pdev)
{
    SCSI_ProcessRead(pdev);
}

static void MSC_BOT_DataReceive(USBD_HandleTypeDef *pdev)
{
    SCSI_ProcessWrite(pdev);
}

static void MSC_BOT_Reset(USBD_HandleTypeDef *pdev)
{
    stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_RECOVERY_DATA_IN;
}

static void MSC_BOT_ClearFeature(USBD_HandleTypeDef *pdev)
{
    uint8_t ep_addr;
    
    ep_addr = stm32l0_usbd_msc_device.feature;

    stm32l0_usbd_msc_device.feature = 0;

    armv6m_svcall_2((uint32_t)&MSC_BOT_ClearHalt, (uint32_t)pdev, (uint32_t)ep_addr);
}

static void MSC_BOT_Open(USBD_HandleTypeDef *pdev)
{
    NVIC_DisableIRQ(USB_IRQn);

    /* Open EP OUT */
    USBD_LL_OpenEP(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR, USBD_EP_TYPE_BULK, STM32L0_USBD_MSC_DATA_MAX_PACKET_SIZE);
    pdev->ep_out[STM32L0_USBD_MSC_DATA_OUT_EP_ADDR & 15].is_used = 1;
  
    /* Open EP IN */
    USBD_LL_OpenEP(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR, USBD_EP_TYPE_BULK, STM32L0_USBD_MSC_DATA_MAX_PACKET_SIZE);  
    pdev->ep_in[STM32L0_USBD_MSC_DATA_IN_EP_ADDR & 15].is_used = 1;
    
    USBD_LL_FlushEP(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR);
    USBD_LL_FlushEP(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR);
    
    /* Prapare EP to Receive First BOT Cmd */
    USBD_LL_PrepareReceive(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.bot_cbw, USBD_BOT_CBW_LENGTH);    

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_Close(USBD_HandleTypeDef *pdev)
{
    NVIC_DisableIRQ(USB_IRQn);

    /* Close MSC EPs */
    USBD_LL_CloseEP(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR);
    pdev->ep_out[STM32L0_USBD_MSC_DATA_OUT_EP_ADDR & 15].is_used = 0;
  
    /* Open EP IN */
    USBD_LL_CloseEP(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR);
    pdev->ep_in[STM32L0_USBD_MSC_DATA_IN_EP_ADDR & 15].is_used = 0;
  
    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_Abort(USBD_HandleTypeDef *pdev, uint8_t abort)
{
    NVIC_DisableIRQ(USB_IRQn);

    switch (abort) {
    case USBD_BOT_ABORT_CBW:
        USBD_LL_StallEP(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR);
        USBD_LL_StallEP(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR);

        stm32l0_usbd_msc_device.bot_csw.bStatus = USBD_BOT_CSW_CMD_FAILED;

        stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_RECOVERY_RESET;
        break;

    case USBD_BOT_ABORT_DATA_IN_CSW_CMD_PASSED:
    case USBD_BOT_ABORT_DATA_IN_CSW_CMD_FAILED:
    case USBD_BOT_ABORT_DATA_IN_CSW_PHASE_ERROR:
        USBD_LL_StallEP(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR);

        stm32l0_usbd_msc_device.bot_csw.bStatus = (abort - USBD_BOT_ABORT_DATA_IN_CSW_CMD_PASSED);

        if (abort == USBD_BOT_ABORT_DATA_IN_CSW_PHASE_ERROR)
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_RECOVERY_RESET;
        }
        else
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_HALT_DATA_IN;
        }
        break;

    case USBD_BOT_ABORT_DATA_OUT_CSW_CMD_PASSED:
    case USBD_BOT_ABORT_DATA_OUT_CSW_CMD_FAILED:
    case USBD_BOT_ABORT_DATA_OUT_CSW_PHASE_ERROR:
        USBD_LL_StallEP(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR);

        stm32l0_usbd_msc_device.bot_csw.bStatus = (abort - USBD_BOT_ABORT_DATA_IN_CSW_CMD_PASSED);

        if (abort == USBD_BOT_ABORT_DATA_OUT_CSW_PHASE_ERROR)
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_RECOVERY_RESET;
        }
        else
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_HALT_DATA_OUT;
        }
        break;

    default:
        break;
    }

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_Stall(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{      
    NVIC_DisableIRQ(USB_IRQn);

    USBD_LL_StallEP(pdev, ep_addr);

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_ClearHalt(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{      
    uint8_t bot_state_previous = stm32l0_usbd_msc_device.bot_state;;
    
    NVIC_DisableIRQ(USB_IRQn);

    USBD_LL_FlushEP(pdev, ep_addr);
    
