GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
#if 0
    USBD_LL_CloseEP(pdev, ep_addr);
    USBD_LL_OpenEP(pdev, ep_addr, USBD_EP_TYPE_BULK, STM32L0_USBD_MSC_DATA_MAX_PACKET_SIZE);
#endif
    
    if (ep_addr == STM32L0_USBD_MSC_DATA_IN_EP_ADDR)
    {
        if (stm32l0_usbd_msc_device.bot_state == USBD_BOT_STATE_RECOVERY_DATA_IN)
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_RECOVERY_DATA_OUT;
        }

        if (stm32l0_usbd_msc_device.bot_state == USBD_BOT_STATE_HALT_DATA_IN)
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_IDLE;
        }
    }

    if (ep_addr == STM32L0_USBD_MSC_DATA_OUT_EP_ADDR)
    {
        if (stm32l0_usbd_msc_device.bot_state == USBD_BOT_STATE_RECOVERY_DATA_OUT)
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_IDLE;
        }

        if (stm32l0_usbd_msc_device.bot_state == USBD_BOT_STATE_HALT_DATA_OUT)
        {
            stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_IDLE;
        }
    }

    if ((stm32l0_usbd_msc_device.bot_state != bot_state_previous) && (stm32l0_usbd_msc_device.bot_state == USBD_BOT_STATE_IDLE))
    {
        USBD_LL_Transmit(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.bot_csw, USBD_BOT_CSW_LENGTH);

        /* Prepare EP to Receive next Cmd */
        USBD_LL_PrepareReceive(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.bot_cbw, USBD_BOT_CBW_LENGTH);  
    }
        
    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_SendCSW(USBD_HandleTypeDef *pdev, uint8_t status)
{
    NVIC_DisableIRQ(USB_IRQn);

    stm32l0_usbd_msc_device.bot_csw.bStatus = status;

    stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_IDLE;

    USBD_LL_Transmit(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.bot_csw, USBD_BOT_CSW_LENGTH);
  
    /* Prepare EP to Receive next Cmd */
    USBD_LL_PrepareReceive(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.bot_cbw, USBD_BOT_CBW_LENGTH);  

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_Transmit(USBD_HandleTypeDef *pdev, const uint8_t *data, uint32_t length)
{
    uint32_t count;
    
    NVIC_DisableIRQ(USB_IRQn);

    count = MIN(stm32l0_usbd_msc_device.bot_csw.dDataResidue, length);

    stm32l0_usbd_msc_device.bot_csw.dDataResidue -= count;

    if (stm32l0_usbd_msc_device.bot_csw.dDataResidue != 0)
    {
	/* case (5) Hi > Di */
	stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_DATA_IN_LAST_STALL;
	// stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_DATA_IN_LAST;
	
	stm32l0_usbd_msc_device.bot_csw.bStatus = USBD_BOT_CSW_CMD_PASSED;
    }
    else
    {
	/* case (6) Hi == Di */
	stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_DATA_IN_LAST;
    }

    USBD_LL_Transmit(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t*)data, length);

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_SetupTransmit(USBD_HandleTypeDef *pdev, uint32_t length)
{
    NVIC_DisableIRQ(USB_IRQn);

    stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_DATA_IN;  
    stm32l0_usbd_msc_device.bot_index = 0;
    stm32l0_usbd_msc_device.bot_count = 1;

    stm32l0_usbd_msc_device.bot_tx_busy = true;
    stm32l0_usbd_msc_device.bot_tx_length = length;

    USBD_LL_Transmit(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.bot_index][0], STM32L0_USBD_MSC_DATA_BLOCK_SIZE);

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_ContinueTransmit(USBD_HandleTypeDef *pdev)
{
    NVIC_DisableIRQ(USB_IRQn);

    stm32l0_usbd_msc_device.bot_count++;

    if (!stm32l0_usbd_msc_device.bot_tx_busy)
    {
	stm32l0_usbd_msc_device.bot_tx_busy = true;
		
	USBD_LL_Transmit(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.bot_index][0], STM32L0_USBD_MSC_DATA_BLOCK_SIZE);
    }
    
    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_FinishTransmit(USBD_HandleTypeDef *pdev, uint8_t status)
{
    MSC_BOT_SendCSW(pdev, status);
}

static void MSC_BOT_SetupReceive(USBD_HandleTypeDef *pdev, uint32_t length)
{
    NVIC_DisableIRQ(USB_IRQn);

    stm32l0_usbd_msc_device.bot_state = USBD_BOT_STATE_DATA_OUT;  
    stm32l0_usbd_msc_device.bot_index = 0;
    stm32l0_usbd_msc_device.bot_count = 1;

    stm32l0_usbd_msc_device.bot_rx_busy = true;
    stm32l0_usbd_msc_device.bot_rx_length = length;

    USBD_LL_PrepareReceive(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.bot_index][0], STM32L0_USBD_MSC_DATA_BLOCK_SIZE);

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_ContinueReceive(USBD_HandleTypeDef *pdev)
{
    NVIC_DisableIRQ(USB_IRQn);

    stm32l0_usbd_msc_device.bot_count--;

    if (!stm32l0_usbd_msc_device.bot_rx_busy)
    {
	if (stm32l0_usbd_msc_device.bot_rx_length >= 1)
	{
	    stm32l0_usbd_msc_device.bot_count++;
	
	    stm32l0_usbd_msc_device.bot_rx_busy = true;
	    
	    USBD_LL_PrepareReceive(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.bot_index][0], STM32L0_USBD_MSC_DATA_BLOCK_SIZE);
	}
    }

    NVIC_EnableIRQ(USB_IRQn);
}

static void MSC_BOT_FinishReceive(USBD_HandleTypeDef *pdev, uint8_t status)
{
    armv6m_atomic_decb(&stm32l0_usbd_msc_device.bot_count);

    MSC_BOT_SendCSW(pdev, status);
}

/***********************************************************************************************************************/

static void USBD_MSC_Process(USBD_HandleTypeDef *pdev)
{
    stm32l0_usbd_msc_routine_t routine;
    uint32_t queue_tail;
    
    queue_tail = stm32l0_usbd_msc_device.queue_tail;

    while (stm32l0_usbd_msc_device.queue_head != queue_tail)
    {
        routine = stm32l0_usbd_msc_device.queue_data[queue_tail];

        queue_tail++;

        if (queue_tail == USBD_MSC_QUEUE_ENTRIES)
        {
            queue_tail = 0;
        }

        stm32l0_usbd_msc_device.queue_tail = queue_tail;

        (*routine)(pdev);
    }
}

static bool USBD_MSC_Submit(stm32l0_usbd_msc_routine_t routine)
{
    uint32_t queue_head, queue_head_next;

    queue_head = stm32l0_usbd_msc_device.queue_head;

