GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_usbd_msc.c
    queue_head_next = queue_head +1;

    if (queue_head_next == USBD_MSC_QUEUE_ENTRIES)
    {
        queue_head_next = 0;
    }

    if (queue_head_next == stm32l0_usbd_msc_device.queue_tail)
    {
        return false;
    }

    stm32l0_usbd_msc_device.queue_data[queue_head] = routine;

    stm32l0_usbd_msc_device.queue_head = queue_head_next;

    if (stm32l0_usbd_msc_device.queue_lock == 0)
    {
        armv6m_work_submit(&stm32l0_usbd_msc_device.queue_work);
    }

    return true;
}

void USBD_MSC_Notify(uint8_t lun, int acquire)
{
    if (acquire)
    {
        armv6m_atomic_add(&stm32l0_usbd_msc_device.queue_lock, 1);
    }
    else
    {
        if (armv6m_atomic_sub(&stm32l0_usbd_msc_device.queue_lock, 1) == 1)
        {
            if (stm32l0_usbd_msc_device.queue_head != stm32l0_usbd_msc_device.queue_tail)
            {
                armv6m_work_submit(&stm32l0_usbd_msc_device.queue_work);
            }
        }
    }
}

uint8_t USBD_MSC_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
    if (!stm32l0_usbd_msc_device.queue_work.callback.routine)
    {
        armv6m_work_create(&stm32l0_usbd_msc_device.queue_work, (armv6m_core_routine_t)USBD_MSC_Process, pdev);
    }

    stm32l0_usbd_msc_device.storage = &dosfs_storage_interface;
    stm32l0_usbd_msc_device.max_lun = 0;
    stm32l0_usbd_msc_device.feature = 0;
    
    if (!USBD_MSC_Submit(MSC_BOT_Init))
    {
        return USBD_FAIL;
    }

    return USBD_OK;
}

uint8_t USBD_MSC_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
    if (!USBD_MSC_Submit(MSC_BOT_DeInit))
    {
        return USBD_FAIL;
    }
    
    return USBD_OK;
}

uint8_t USBD_MSC_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
    uint8_t ep_addr;
    
    switch (req->bmRequest & USB_REQ_TYPE_MASK) {

        /* Class request */
    case USB_REQ_TYPE_CLASS:
        switch (req->bRequest) {
        case USBD_BOT_GET_MAX_LUN:
	    if((req->wValue  == 0) && 
               (req->wLength == 1) &&
               ((req->bmRequest & 0x80) == 0x80))
            {
                USBD_CtlSendData(pdev, (uint8_t*)&stm32l0_usbd_msc_device.max_lun, 1);
            }
            else
            {
                USBD_CtlError(pdev, req);

                return USBD_FAIL; 
            }
            break;
      
        case USBD_BOT_RESET:
            if((req->wValue  == 0) && 
               (req->wLength == 0) &&
               ((req->bmRequest & 0x80) != 0x80))
            {      
                if (!USBD_MSC_Submit(MSC_BOT_Reset))
                {
                    return USBD_FAIL;
                }
            }
            else
            {
                USBD_CtlError(pdev, req);

                return USBD_FAIL; 
            }
            break;

        default:
            USBD_CtlError(pdev, req);

            return USBD_FAIL; 
        }
        break;

        /* Interface & Endpoint request */
    case USB_REQ_TYPE_STANDARD:
        switch (req->bRequest) {
        case USB_REQ_GET_INTERFACE:
            USBD_CtlSendData(pdev, (uint8_t *)&stm32l0_usbd_msc_device.interface, 1);
            break;
      
        case USB_REQ_SET_INTERFACE:
            stm32l0_usbd_msc_device.interface = (uint8_t)(req->wValue);
            break;
            
        case USB_REQ_CLEAR_FEATURE:  
            if (req->wValue == USB_FEATURE_EP_HALT)
            {
                ep_addr = LOBYTE(req->wIndex);

                if ((ep_addr == STM32L0_USBD_MSC_DATA_IN_EP_ADDR) || (ep_addr == STM32L0_USBD_MSC_DATA_OUT_EP_ADDR))
                {
                    stm32l0_usbd_msc_device.feature = ep_addr;
            
                    if (!USBD_MSC_Submit(MSC_BOT_ClearFeature))
                    {
                        return USBD_FAIL;
                    }
                }
            }
            break;
        }  
        break;
   
    default:
        break;
    }

    return USBD_OK;
}

uint8_t USBD_MSC_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
    if (stm32l0_usbd_msc_device.bot_tx_length)
    {
	stm32l0_usbd_msc_device.bot_csw.dDataResidue -= STM32L0_USBD_MSC_DATA_BLOCK_SIZE;

	stm32l0_usbd_msc_device.bot_tx_busy = false;
	stm32l0_usbd_msc_device.bot_tx_length -= 1;
	
	stm32l0_usbd_msc_device.bot_count -= 1;
	stm32l0_usbd_msc_device.bot_index ^= 1;
	
	if (!USBD_MSC_Submit(MSC_BOT_DataTransmit))
	{
	    return USBD_FAIL;
	}

	if (stm32l0_usbd_msc_device.bot_tx_length >= 1)
	{
	    if (stm32l0_usbd_msc_device.bot_count != 0)
	    {
		stm32l0_usbd_msc_device.bot_tx_busy = true;
		
		USBD_LL_Transmit(pdev, STM32L0_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.bot_index][0], STM32L0_USBD_MSC_DATA_BLOCK_SIZE);
	    }
	}
    }
    else
    {
	if (!USBD_MSC_Submit(MSC_BOT_DataIn))
	{
	    return USBD_FAIL;
	}
    }

    return USBD_OK;
}

uint8_t USBD_MSC_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
    if (stm32l0_usbd_msc_device.bot_rx_length)
    {
	stm32l0_usbd_msc_device.bot_rx_busy = false;
	stm32l0_usbd_msc_device.bot_rx_length -= 1;

	stm32l0_usbd_msc_device.bot_index ^= 1;
	
	if (!USBD_MSC_Submit(MSC_BOT_DataReceive))
	{
	    return USBD_FAIL;
	}

	if (stm32l0_usbd_msc_device.bot_rx_length >= 1)
	{
	    if (stm32l0_usbd_msc_device.bot_count != 2)
	    {
		stm32l0_usbd_msc_device.bot_count++;
		
		stm32l0_usbd_msc_device.bot_rx_busy = true;

		USBD_LL_PrepareReceive(pdev, STM32L0_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32l0_usbd_msc_device.scsi_data[stm32l0_usbd_msc_device.bot_index][0], STM32L0_USBD_MSC_DATA_BLOCK_SIZE);
	    }
	}
    }
    else
    {
	if (!USBD_MSC_Submit(MSC_BOT_DataCBW))
	{
	    return USBD_FAIL;
	}
    }
    
    return USBD_OK;
}
